InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры/Forms/ФормаЗагрузкиПрайса/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьПрайсЛист(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ДатаПрайсЛиста) Или Не ЗначениеЗаполнено(ВидЦеныПродажи) Тогда
		Сообщить("Заполните дату и вид цены продажи!");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СкопироватьФайлНаСерверЗавершение", ЭтотОбъект, "ТабличныйДокумент");
	НачатьПомещениеФайлаНаСервер(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайлНаСерверЗавершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайлаВХранилище = ОписаниеПомещенногоФайла.Адрес;
	
	КоличествоЗагружено = ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайлаВХранилище, ДатаПрайсЛиста, ВидЦеныПродажи);
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Успешно загружено строк: " + КоличествоЗагружено + "!";
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайлаВХранилище, Знач ДатаПрайсЛиста, Знач ВидЦеныПродажи)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xlsx");
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Попытка
		ТабличныйДокумент.Прочитать(ИмяВременногоФайла);
	Исключение
		ВызватьИсключение "Не удалось прочитать файл Excel!";
	КонецПопытки;
	
	ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
	
	ТаблицаПрайсЛиста = Новый ТаблицаЗначений;
	
	ТаблицаПрайсЛиста.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	ТаблицаПрайсЛиста.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	
	Для Счетчик = 2 По ВысотаТаблицы Цикл
		
		НаименованиеТовара = СокрЛП(ТабличныйДокумент.Область("R" + Формат(Счетчик, "ЧГ=0") + "C2").Текст);
		ЦенаТекст          = ТабличныйДокумент.Область("R" + Формат(Счетчик, "ЧГ=0") + "C4").Текст;
		
		Если ПустаяСтрока(НаименованиеТовара) Тогда
			Продолжить;
		КонецЕсли;
		
		ЧистаяЦена = СтрЗаменить(ЦенаТекст, Символы.НПП, "");
		ЧистаяЦена = СтрЗаменить(ЧистаяЦена, " ", "");
		ЧистаяЦена = СтрЗаменить(ЧистаяЦена, ",", ".");
		
		ЦенаЧисло = 0;
		Попытка
			ЦенаЧисло = Число(ЧистаяЦена);
		Исключение
			ЦенаЧисло = 0;
		КонецПопытки;
		
		НоваяСтрока = ТаблицаПрайсЛиста.Добавить();
		НоваяСтрока.Наименование = НаименованиеТовара;
		НоваяСтрока.Цена         = ЦенаЧисло;
		
	КонецЦикла;
	
	УспешноЗагружено = 0;
	Если ТаблицаПрайсЛиста.Количество() = 0 Тогда
		Возврат УспешноЗагружено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаПрайсЛиста.Наименование КАК СТРОКА(150)) КАК Наименование,
	|	ТаблицаПрайсЛиста.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаПрайсЛиста
	|ИЗ
	|	&ТаблицаПрайсЛиста КАК ТаблицаПрайсЛиста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Ссылка КАК Номенклатура,
	|	ВТ_ТаблицаПрайсЛиста.Цена КАК Цена
	|ИЗ
	|	ВТ_ТаблицаПрайсЛиста КАК ВТ_ТаблицаПрайсЛиста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ВТ_ТаблицаПрайсЛиста.Наименование = Ном.Наименование
	|ГДЕ
	|	Ном.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ТаблицаПрайсЛиста", ТаблицаПрайсЛиста);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Период       = ДатаПрайсЛиста;
		МенеджерЗаписи.ВидЦены      = ВидЦеныПродажи;
		МенеджерЗаписи.Номенклатура = Выборка.Номенклатура;
		МенеджерЗаписи.Цена         = Выборка.Цена;
		
		МенеджерЗаписи.Записать(Истина);
		
		УспешноЗагружено = УспешноЗагружено + 1;
		
	КонецЦикла;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
	КонецПопытки;
	
	Возврат УспешноЗагружено;
	
КонецФункции
